Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ble/building_blocks/multirole/multilink/firmware/src/packs/WBZ451_DFP/component/cru.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CRU register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       CRU_OSCCON;         /**< Offset: 0x00 (R/W  32) CRU OSCILLATOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_OSCCONCLR;      /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCCONSET;      /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCCONINV;      /**< Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       CRU_OSCTUN;         /**< Offset: 0x10 (R/W  32) CRU OSCILLATOR TRIMMING REGISTER */
  __IO  uint32_t                       CRU_OSCTUNCLR;      /**< Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCTUNSET;      /**< Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       CRU_OSCTUNINV;      /**< Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       CRU_SPLLCON;        /**< Offset: 0x20 (R/W  32) SPLL CONTROL REGISTER */
  __IO  uint32_t                       CRU_SPLLCONCLR;     /**< Offset: 0x24 (R/W  32)  */
  __IO  uint32_t                       CRU_SPLLCONSET;     /**< Offset: 0x28 (R/W  32)  */
  __IO  uint32_t                       CRU_SPLLCONINV;     /**< Offset: 0x2C (R/W  32)  */
  __I   uint8_t                        Reserved1[0x40];
  __IO  uint32_t                       CRU_REFO1CON;       /**< Offset: 0x70 (R/W  32) REFERENCE OSCILLATOR 1 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO1CONCLR;    /**< Offset: 0x74 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1CONSET;    /**< Offset: 0x78 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1CONINV;    /**< Offset: 0x7C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1TRIM;      /**< Offset: 0x80 (R/W  32) REFERENCE OSCILLATOR 1 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO1TRIMCLR;   /**< Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1TRIMSET;   /**< Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO1TRIMINV;   /**< Offset: 0x8C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2CON;       /**< Offset: 0x90 (R/W  32) REFERENCE OSCILLATOR 2 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO2CONCLR;    /**< Offset: 0x94 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2CONSET;    /**< Offset: 0x98 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2CONINV;    /**< Offset: 0x9C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2TRIM;      /**< Offset: 0xA0 (R/W  32) REFERENCE OSCILLATOR 2 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO2TRIMCLR;   /**< Offset: 0xA4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2TRIMSET;   /**< Offset: 0xA8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO2TRIMINV;   /**< Offset: 0xAC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3CON;       /**< Offset: 0xB0 (R/W  32) REFERENCE OSCILLATOR 3 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO3CONCLR;    /**< Offset: 0xB4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3CONSET;    /**< Offset: 0xB8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3CONINV;    /**< Offset: 0xBC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3TRIM;      /**< Offset: 0xC0 (R/W  32) REFERENCE OSCILLATOR 3 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO3TRIMCLR;   /**< Offset: 0xC4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3TRIMSET;   /**< Offset: 0xC8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO3TRIMINV;   /**< Offset: 0xCC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4CON;       /**< Offset: 0xD0 (R/W  32) REFERENCE OSCILLATOR 4 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO4CONCLR;    /**< Offset: 0xD4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4CONSET;    /**< Offset: 0xD8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4CONINV;    /**< Offset: 0xDC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4TRIM;      /**< Offset: 0xE0 (R/W  32) REFERENCE OSCILLATOR 4 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO4TRIMCLR;   /**< Offset: 0xE4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4TRIMSET;   /**< Offset: 0xE8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO4TRIMINV;   /**< Offset: 0xEC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5CON;       /**< Offset: 0xF0 (R/W  32) REFERENCE OSCILLATOR 5 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO5CONCLR;    /**< Offset: 0xF4 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5CONSET;    /**< Offset: 0xF8 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5CONINV;    /**< Offset: 0xFC (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5TRIM;      /**< Offset: 0x100 (R/W  32) REFERENCE OSCILLATOR 5 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO5TRIMCLR;   /**< Offset: 0x104 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5TRIMSET;   /**< Offset: 0x108 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO5TRIMINV;   /**< Offset: 0x10C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6CON;       /**< Offset: 0x110 (R/W  32) REFERENCE OSCILLATOR 6 CONTROL REGISTER */
  __IO  uint32_t                       CRU_REFO6CONCLR;    /**< Offset: 0x114 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6CONSET;    /**< Offset: 0x118 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6CONINV;    /**< Offset: 0x11C (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6TRIM;      /**< Offset: 0x120 (R/W  32) REFERENCE OSCILLATOR 6 TRIM REGISTER */
  __IO  uint32_t                       CRU_REFO6TRIMCLR;   /**< Offset: 0x124 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6TRIMSET;   /**< Offset: 0x128 (R/W  32)  */
  __IO  uint32_t                       CRU_REFO6TRIMINV;   /**< Offset: 0x12C (R/W  32)  */
  __IO  uint32_t                       CRU_PB1DIV;         /**< Offset: 0x130 (R/W  32) PB1 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB1DIVCLR;      /**< Offset: 0x134 (R/W  32)  */
  __IO  uint32_t                       CRU_PB1DIVSET;      /**< Offset: 0x138 (R/W  32)  */
  __IO  uint32_t                       CRU_PB1DIVINV;      /**< Offset: 0x13C (R/W  32)  */
  __IO  uint32_t                       CRU_PB2DIV;         /**< Offset: 0x140 (R/W  32) PB2 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB2DIVCLR;      /**< Offset: 0x144 (R/W  32)  */
  __IO  uint32_t                       CRU_PB2DIVSET;      /**< Offset: 0x148 (R/W  32)  */
  __IO  uint32_t                       CRU_PB2DIVINV;      /**< Offset: 0x14C (R/W  32)  */
  __IO  uint32_t                       CRU_PB3DIV;         /**< Offset: 0x150 (R/W  32) PB3 CLOCK DIVISOR CONTROL REGISTER */
  __IO  uint32_t                       CRU_PB3DIVCLR;      /**< Offset: 0x154 (R/W  32)  */
  __IO  uint32_t                       CRU_PB3DIVSET;      /**< Offset: 0x158 (R/W  32)  */
  __IO  uint32_t                       CRU_PB3DIVINV;      /**< Offset: 0x15C (R/W  32)  */
  __IO  uint32_t                       CRU_SLEWCON;        /**< Offset: 0x160 (R/W  32) SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER */
  __IO  uint32_t                       CRU_SLEWCONCLR;     /**< Offset: 0x164 (R/W  32)  */
  __IO  uint32_t                       CRU_SLEWCONSET;     /**< Offset: 0x168 (R/W  32)  */
  __IO  uint32_t                       CRU_SLEWCONINV;     /**< Offset: 0x16C (R/W  32)  */
  __IO  uint32_t                       CRU_CLKSTAT;        /**< Offset: 0x170 (R/W  32) CLOCK STATUS REGISTER */
  __I   uint8_t                        Reserved2[0x1C];
  __IO  uint32_t                       CRU_CLKDIAG;        /**< Offset: 0x190 (R/W  32) USER CLK DIAGNOSTICS CONTROL REGISTER */
} cru_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_CRU_COMPONENT_H_ */
